# Hanukka of Data -- Day 2: The Contractor

In [1]:
import pandas as pd

In [2]:
customers = pd.read_csv("../data/5784/noahs-customers.csv")
products = pd.read_csv("../data/5784/noahs-products.csv")
order_items = pd.read_csv("../data/5784/noahs-orders_items.csv")
orders = pd.read_csv("../data/5784/noahs-orders.csv")

In [3]:
customers["first_name"] = customers["name"].str.split(" ").str[0]
customers["last_name"] = customers["name"].str.split(" ").str[1]
customers["initials"] = customers["first_name"].str[0] + customers["last_name"].str[0]

customers_JP = customers.loc[customers["initials"] == "JP", ["name", "initials", "customerid", "phone"]]
customers_JP.head()

                 name initials  customerid         phone
165     John Phillips       JP        1166  716-900-2422
194        Julie Page       JP        1195  332-864-1901
263      Justin Perez       JP        1264  585-300-8492
297  Jacqueline Patel       JP        1298  430-877-4645
311         Judy Page       JP        1312  516-779-4396

In [4]:
rug_cleaner_sku = products.loc[products["desc"] == "Rug Cleaner", "sku"].values[0]
rug_cleaner_sku

'HOM2761'

In [5]:
rug_cleaner_orderids = order_items.loc[order_items["sku"] == rug_cleaner_sku, "orderid"].to_list()

In [6]:
rug_cleaner_orders = orders.loc[orders["orderid"].isin(rug_cleaner_orderids)]
rug_cleaner_orders.head()

,orderid,customerid,ordered,shipped,items,total
474,1475,8688,2017-02-04 17:59:20,2017-02-11 08:00:00,NaN,20.43
1029,2030,1843,2017-02-10 08:03:42,2017-02-10 15:00:00,NaN,7.50
2083,3084,3649,2017-02-19 15:31:01,2017-02-19 15:31:01,NaN,7.35
3041,4042,7271,2017-03-01 12:53:18,2017-03-01 12:53:18,NaN,2.03
4173,5174,8587,2017-03-12 16:33:06,2017-03-12 17:00:00,NaN,8.48

In [7]:
match = pd.merge(customers_JP, rug_cleaner_orders, how="inner", on="customerid")
match.loc[match["ordered"].str[:4] == "2017"]

,name,initials,customerid,phone,orderid,ordered,shipped,items,total
0,Joshua Peterson,JP,1475,332-274-4185,7459,2017-04-05 11:42:15,2017-04-05 11:42:15,NaN,4.96
1,Joshua Peterson,JP,1475,332-274-4185,7783,2017-04-08 14:53:52,2017-04-08 14:53:52,NaN,3.98
2,Joshua Peterson,JP,1475,332-274-4185,8051,2017-04-11 07:02:16,2017-04-11 07:02:16,NaN,3.54
3,Joshua Peterson,JP,1475,332-274-4185,8375,2017-04-14 15:58:01,2017-04-14 15:58:01,NaN,3.58
4,Joshua Peterson,JP,1475,332-274-4185,8663,2017-04-17 12:12:21,2017-04-17 12:12:21,NaN,3.36